# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [28]:
s1 = pd.Series(np.random.randint(1,high=5,size=100,dtype='l'))
s2 = pd.Series(np.random.randint(1,high=4,size=100,dtype='l'))
s3 = pd.Series(np.random.randint(10000,high=30001,size=100,dtype='l'))
s3

0     14324
1     26057
2     15590
3     28273
4     10697
      ...
95    24472
96    28591
97    12376
98    19845
99    21871
Length: 100, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [29]:
df = pd.concat([s1,s2,s3],axis=1)
df

    0  1      2
0   1  2  14324
1   1  3  26057
2   4  1  15590
3   1  3  28273
4   4  3  10697
.. .. ..    ...
95  1  3  24472
96  3  3  28591
97  4  3  12376
98  1  3  19845
99  3  1  21871

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [27]:
df.rename(columns={0:'bedrs',1:'bathrs',2:'price_sqr_meter'},inplace=True)
df

    bedrs  bathrs  price_sqr_meter
0       4       2            15814
1       4       2            20653
2       3       2            26269
3       1       3            11342
4       4       2            27252
..    ...     ...              ...
95      4       1            28564
96      2       3            20099
97      1       3            26832
98      1       3            20981
99      1       2            25476

[100 rows x 3 columns]

In [33]:
df.rename(columns = dict(zip(range(3),['bedrs','bathrs','price_sqr_meter'])),inplace=True)
df

    bedrs  bathrs  price_sqr_meter
0       1       2            14324
1       1       3            26057
2       4       1            15590
3       1       3            28273
4       4       3            10697
..    ...     ...              ...
95      1       3            24472
96      3       3            28591
97      4       3            12376
98      1       3            19845
99      3       1            21871

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [34]:
#답지

# join concat the values
bigcolumn = pd.concat([s1, s2, s3], axis=0)

# it is still a Series, so we need to transform it to a DataFrame
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))

bigcolumn

0   bedrs                  1
    bathrs                 2
    price_sqr_meter    14324
1   bedrs                  1
    bathrs                 3
                       ...
98  bathrs                 3
    price_sqr_meter    19845
99  bedrs                  3
    bathrs                 1
    price_sqr_meter    21871
Length: 300, dtype: int32

In [35]:
bigcolumn = pd.concat([s1,s2,s3])

In [38]:
print(type(bigcolumn))
bigcolumn

<class 'pandas.core.series.Series'>

0         1
1         1
2         4
3         1
4         4
      ...
95    24472
96    28591
97    12376
98    19845
99    21871
Length: 300, dtype: int32

In [39]:
big=bigcolumn.to_frame()

In [40]:
type(big)

pandas.core.frame.DataFrame

In [41]:
big

        0
0       1
1       1
2       4
3       1
4       4
..    ...
95  24472
96  28591
97  12376
98  19845
99  21871

[300 rows x 1 columns]

### Step 6. Ops it seems it is going only until index 99. Is it true?

In [42]:
len(big)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [44]:
big.reset_index(drop=True,inplace=True)
big

         0
0        1
1        1
2        4
3        1
4        4
..     ...
295  24472
296  28591
297  12376
298  19845
299  21871

[300 rows x 1 columns]